{
  "companyName": "Maison Albion",
  "timezone": "America/New_York",
  "address": {
    "street": "13800 W County House Rd",
    "city": "Albion",
    "state": "New York",
    "postalCode": "14411",
    "country": "US"
  },
  "contact": {
    "email": "bonjour@maisonalbion.com",
    "phone": "",
    "website": "https://www.maisonalbion.com"
  },
  "businessHours": {
    "monday": {
      "start": "09:00",
      "end": "17:00"
    },
    "tuesday": {
      "start": "09:00",
      "end": "17:00"
    },
    "wednesday": {
      "start": "09:00",
      "end": "17:00"
    },
    "thursday": {
      "start": "09:00",
      "end": "17:00"
    },
    "friday": {
      "start": "09:00",
      "end": "17:00"
    },
    "saturday": {
      "start": "10:00",
      "end": "14:00"
    },
    "sunday": {
      "start": "",
      "end": ""
    }
  },
  "knownLinks": {
    "website": "https://www.maisonalbion.com",
    "tourBooking": "{{tour_booking_link}}",
    "manageTour": "{{manage_tour_link}}"
  },
  "siteSnapshot": {
    "origin": "https://www.maisonalbion.com",
    "crawledAt": "2026-02-14T02:14:07.362Z",
    "pageCount": 10,
    "pages": [
      {
        "url": "https://www.maisonalbion.com",
        "title": "Maison Albion | Historic Wedding Venue in Western NY",
        "description": "Historic 1878 Victorian mansion wedding venue serving Buffalo, Rochester & Western NY. Exclusive venue access, open vendor policy, packages from $5,000. Book your tour.",
        "textSample": "--> Maison Albion | Historic Wedding Venue in Western NY top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour View Our Film Download Venue Guide Maison Albion: Historic Victorian Wedding Estate in Western New York Your Exclusive Victorian Wedding Estate in Western New York ​ An 1878 French-inspired mansion in Albion, NY&mdash;perfectly positioned between Buffalo and Rochester on a private 7-acre estate Pricing & Photos (The complete venue guide&mdash;free) ​ Or schedule your private tour &rarr; \"3 out of 4 couples who visit Maison Albion reserve their wedding date with us. \" \"The Venue Guide answered all of our questions. We booked our tour the same day.\" &mdash; Sarah & Mike, married October 2024 Why Couples Choose Maison Albion Complete Transparency Wedding packages from $5,000 All pricing included in our comprehensive venue guide&mdash;wedding packages, reception services, ceremony options, and overnight accommodations. ​ No hidden fees. No surprises. Taxes, service charges, and credit card processing fees all included. Know exactly what your wedding celebration will cost before you tour. ​ Exclusive to You One wedding per day Our dedicated event team is devoted exclusively to your celebration. ​ Your guests experience the entire estate&mdash;design your wedding day using all 12,000 square feet of our Victorian mansion and seven acres of private grounds. Indoor and outdoor ceremony options included. ​ Your Day, Your Vendors Complete vendor freedom Use our preferred vendor list or bring your own caterer, photographer, florist, DJ, and wedding planner. ​ We never require you to use specific vendors. Outside catering welcome. Llamas? Yes! Fire pits? Absolutely! Let's plan your dream wedding the way you've always imagined. Thoughtful Financing Affordable Luxury Interest free payment arrangements with initial payments from $3,000. ​ Complete terms in our ven"
      },
      {
        "url": "https://www.maisonalbion.com/wedding-venue",
        "title": "The Mansion & Grounds | Western NY Wedding Venue",
        "description": "Explore Maison Albion’s restored 1878 mansion, gardens and terrace ceremony spaces near Buffalo and Rochester, NY—perfect for elegant indoor–outdoor weddings.",
        "textSample": "--> The Mansion & Grounds | Western NY Wedding Venue top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour Wedding Spaces at Maison Albion Mansion, Ballroom & Gardens Pretty places for perfect parties Get the Guide The vision of Maison Albion is to ignite the romance and imagination of all who enter her gates. May you and your guests be transported to another time in history when gardens bloomed with color galore and interiors beamed in subtle tones of splendor. Our mission is to enchant our guests at every opportunity. From an encounter online on social media, to a phone call, or a site tour, we seek to welcome all of our guests with the utmost hospitality and care. Maison Albion is a physical embodiment of Western New York&rsquo;s French influence. The natural charm and beauty of the property will be accented with light and airy French design and bright, cheery, and colorful gardens. This historic Albion mansion has been renovated and reinvigorated to ignite the romance and passion of its guests. We invite you to explore our spaces and rooms! Pricing & Photos Venue The Ballroom Decadent, Traditional, Vintage Styling Modeled after the Dining Room of the Titantic, our Ballroom evokes the feeling of a bygone era. Rich dark wood walls and Belgian silk fabric panels set the stage for the sparkling chandeliers and stunning bar. ​ Capacity: 299 Guests Ceremony/Classroom/Cocktail 250 Guests seated at round tables Access Venue Guide Pricing & Photos Reception Layout Rose Apothecary Styled Shoot Reception Layout 1/8 Ballroom Patio A Victorian conservatory meets Parisian Bistro Authentic Parisian Bistro chairs and tables await your guests to offer respite from a warm summer day. The Ballroom Patio is full of palm and banana leaf trees, an antique box piano, and mint lattice details. It also serves as a perfect ceremony weather backup. ​ Capacity: 250 Guests Ceremony"
      },
      {
        "url": "https://www.maisonalbion.com/accommodations",
        "title": "Accommodations | Stay at Maison Albion Mansion",
        "description": "Plan an overnight stay at Maison Albion’s historic mansion. Charming guest rooms and easy access to local hotels and inns for your wedding guests in Western NY.",
        "textSample": "--> Accommodations | Stay at Maison Albion Mansion top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour Wedding Accommodations at Maison Albion Accommodations Scenic Stays Accommodations Sleep like royalty in our four ravishing rooms Maison Albion opens its doors to guests to stay overnight after an event at our venue. Spend your wedding night with us, or y ou can even unwind after a day of festivities in our movie theatre. Maison Albion has four unique rooms, designed with French provencal details and antique furniture. All rooms include luxury linens, robes, and turn down service. After your royal night's sleep, you will wake up to the smell of a homemade French breakfast served in our Dining Room. Accomodations Bridal Suite Beautiful bedroom for you and your amour A custom French baroque bed, 10 foot tall antique gold mirror and vanity sets the perfect stage for a bridal moment and honeymoon evening. Full bathroom with steam shower and with fresh towels en suite. Bridesmaids Suite Pretty in pink made for your ladies The seventeen foot long resin vanity tabletop is set with antique sconces, five makeup and hair stations for your ladies to primp on the special day! Our trundle bed sleeps two. Guest Suites Edwardian palette sets a calm mood in these two rooms. These two lovely bedrooms are both set with four poster beds, hand made linens in French and Chinoiserie design. Perfect for parents or important guests. Scenic Stays Maison Albion is surrounded by hotels, lodging, and cottage rentals. Below are a few options! Oak Orchard Stay The Lake House - Sleeps 8 The Fair Haven Inn - Sleeps 18 The Catfish Cottage - Sleeps 2 The Princess of the Oak - Sleeps 2 ​ ​ Comfort Inn & Suites ​ The Boutique Hotel at Bent's Opera House ​ Hart House Hotel Scenic Stays An 1878 French Luxury Estate in Western New York PLAN YOUR VISIT Book a Tour Download Venue Guide FAQ ​​ A"
      },
      {
        "url": "https://www.maisonalbion.com/seasons",
        "title": "Maison Albion in Every Season | Spring, Summer, Fall, Winter",
        "description": "See Maison Albion in every season. View spring blooms, lush summer gardens, autumn color and winter wonderland inspiration for your Western New York wedding.",
        "textSample": "--> Maison Albion in Every Season | Spring, Summer, Fall, Winter top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour Maison Albion in Season We love making magic at Maison Albion, and we are able to make magic happen all year round! Whether you're dreaming of a white winter wedding, or a colorful summer wedding, your day will be filled with special Maison Magic. Below, you'll find photos of Maison Albion in every season! Spring Summer Autumn Winter Spring Summer Autumn Winter Spring Summer Autumn Winter An 1878 French Luxury Estate in Western New York PLAN YOUR VISIT Book a Tour Download Venue Guide FAQ ​​ ABOUT THE VENUE Wedding Packages Venue Features Accommodations Gallery Our History SERVICES Wedding Venue Mixologie My Own Maison Upgrade Your Wedding Micro Wedding Accommodation RESOURCES Pricing & Packages FAQ Blog Real Weddings Preferred Vendors Contact Us Download Venue Guide CONTACT Maison Albion 13800 W County House Rd Albion, NY 14411 ​ 585.488.4899 bonjour@maisonalbion.com Venue Guide Book Your Tour Instagram | Pinterest | Facebook ​ &copy; 2026 Maison Albion | Privacy Policy | About Us SERVING WESTERN NEW YORK Buffalo & Erie County | Rochester & Monroe County | Western New York Orleans County | Genesee County | Niagara Falls | Finger Lakes Also serving: Niagara, Wayne, Ontario, Livingston Counties ​ Buffalo couples, see Buffalo-specific details &rarr; Rochester couples, see Rochester-specific details &rarr; Planning a Western NY wedding? Learn more &rarr; bottom of page"
      },
      {
        "url": "https://www.maisonalbion.com/about",
        "title": "About Maison Albion | Historic 1878 French Victorian Estate",
        "description": "Maison Albion is a historic mansion wedding and event venue in Western New York near Rochester and Buffalo.",
        "textSample": "--> About Maison Albion | Historic 1878 French Victorian Estate top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour About Maison Albion: Our Historic 1878 French Estate A Wedding and Event Venue Maison Albion is a historic mansion reimagined to host magnificent weddings and events. Located in Albion, New York, visitors are transported to a time of luxurious craftsmanship, baroque decadence, and lavish celebrations. The 1878 mansion is accompanied by a breathtaking ballroom and parklike grounds reminiscent of a late 19th century French cottage. The English Country gardens welcome guests to stroll and lounge on the manicured lawn. You can enjoy a picnic in the Great Lawn, indulge in a romantic dinner in the Secret Garden, and even cozy up with your beloved in the handcrafted rowboat floating gently in the pond. Guests also have the option to stay overnight in our four exquisitely decorated guest bedrooms with access to amazing restaurants, hotels and businesses within minutes of Maison Albion. Photo by Livt T Photography Pretty Places for Perfect Parties We have the perfect place for your distinct needs, whether you want to host an unforgettable reception, a ceremony in the secret garden, or move in to the mansion for a full weekend of celebration. Maison Albion opens her doors to you for your enchanted event! ​ Parties of 10 up to 1000 are welcome to celebrate in the elegant surroundings of Maison. ​ As you peruse her sprawling grounds and well appointed mansion you are sure to find the perfect location for the celebration of your dreams. ​ Maison Albion invites you to host your beautiful and joy-filled event with us! Design your Celebration At Maison Albion, we believe in love, magic, and the freedom to express yourself through custom design and details. Our mansion, ballroom, patio and grounds include endless possibilities for any celebration. ​ Maison A"
      },
      {
        "url": "https://www.maisonalbion.com/history",
        "title": "Past, Present & Future | History of Maison Albion Mansion",
        "description": "Discover how a historic 1878 mansion in Albion, NY was lovingly restored and reimagined as Maison Albion, a French-inspired wedding and event venue.",
        "textSample": "--> Past, Present & Future | History of Maison Albion Mansion top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour The History of Maison Albion: From 1878 to Today Our History, The Past In January 1832, Stephen A. Knaap purchased the land formerly known as &ldquo;The Hickories&rdquo;. The land consisted of seven barns and two tenant houses. In 1849, Samuel R. Howes purchased the land which his son, Arthur C. Howes later inherited. The original land contained twenty-one acres of apples including, Maiden Blush, Kings, Baldwins, Greenings and the Twenty Ounce. The rest of the farm was utilized for growth of hay, corn, wheat, oats, potatoes, cabbage and other fruits. While Howes owned the property, tenant buildings were considered &ldquo;high-class&rdquo; consisting of a modern frame, lighted by gas and heated by hot water and hot air. In 1879, the land was inherited by William Carr&rsquo;s first wife, Myrtie Carr. The Carr family built the home, formerly known as &ldquo;The White Pillars&rdquo; and used the farm land for dairy cows. The home was an Italianate style home, with the pillars being added in 1914. In 1944 Myrtie Carr unexpectedly passed away. As a widower, William then meets his second wife Patricia who was significantly younger than he. Patricia moved to New York City at the age of 16 and was a showgirl for years. She then moved to Orleans County with William, they married and she learned to be a farmer&rsquo;s wife. Patricia kept a journal of her experiences at the home. Survived by her step-grandchild Nicki Carr Tiffany, the book The Long-Legged View was published. In the novel, Patricia mentions a photo of a purple peacock on the wall, during Kerri and Cole&rsquo;s restoration of the home, a purple peacock was added to the dining room wall as a reference to the memoir. After the death of William Carr, the home was turned into apartments where m"
      },
      {
        "url": "https://www.maisonalbion.com/meet-our-team",
        "title": "Meet Our Team | Wedding Experts at Maison Albion",
        "description": "Meet the family behind Maison Albion. Owners Kerri and Cole and their team bring 20+ years of wedding, hospitality and sales experience to your celebration.",
        "textSample": "--> Meet Our Team | Wedding Experts at Maison Albion top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour Magic Makers of Maison Michael, Kerri and Cole Michael, Kerri and Cole press to zoom It&rsquo;s a family affair. The owners of Maison Albion are a husband, wife and brother with over twenty years of hospitality, wedding, and sales experience. In 1999, Kerri Glover started her first wedding planning company and over time, she grew the company to be the largest wedding and event planning agency in the state of Colorado, executing over 180 events annually with 20 planners on staff. During this time, Kerri was also fortunate to build, design, and launch thirteen wedding venues across the country for other investors. She used her wedding experience and business background to create spaces that couples would enjoy sharing with their guests to create meaningful memories. In 2016, Kerri sold her company, now called A Touch of Bliss. Her husband Cole Glover brought his fifteen years of sales background to their new shared venture Flourish . From Hawaii to New York, their clients benefit from their strong sales and marketing experience in the hospitality industry. When the opportunity to purchase the former &ldquo;Pillars Estate&rdquo; in Albion came to their attention, Kerri and Cole partnered with Kerri&rsquo;s brother Michael Bolster to purchase and renovate the property to become Maison Albion. Since then, The Glovers have added to their team! ​ Maison Magic Makers Sarah Omicioli Venue director sarah@maisonalbion.com Samantha Verveine Innkeeper samantha@maisonalbion.com MacKenzie Blood Bar director, Mixologie mackenzie@maisonalbion.com I&rsquo;m Sarah, the Venue Director at Maison Albion. With a decade of industry experience and enthusiastic &ldquo;yes&rdquo; energy, I am dedicated to turning your event vision into reality. In addition to managing the myriad"
      },
      {
        "url": "https://www.maisonalbion.com/wedding-venue-investment",
        "title": "Wedding Pricing & Packages | Starting at $5,000 | Maison Albion",
        "description": "Let",
        "textSample": "--> Wedding Pricing & Packages | Starting at $5,000 | Maison Albion top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour Your Wedding Journey Begins Here Your comprehensive wedding brochure arrives within moments. It includes complete pricing, financing options, and everything you need to envision your Maison Albion celebration. Inside Your Maison Albion Brochure ✦ Complete pricing for all celebration styles Microwedding, signature package, and inclusive packages for every day, in all seasons. ✦ Interest-free financing details Secure your date with $3,000 as your initial payment&mdash;complete payment schedules and monthly arrangement options are available with no interest or fees. ✦ No hidden fees, full transparency Unlike other venues, we do not charge administrative fees, service charges, gratuities, or credit card transaction costs ✦ Complete Mixologie bar service pricing Professional bartending packages from intimate gatherings to grand celebrations, allowing you to provide your own alcohol instead of pricey bar packages. ✦ 50+ wedding upgrade options with pricing From wisteria installations to llama groomsmen&mdash;get a sneak peek for ideas on how to make your wedding uniquely yours! ✦ Exclusive vendor partnerships Our vetted Party Partners for catering, photography, planning, and entertainment&mdash;complete with contact information ✦ Real venue spaces in detail Full gallery of the Ballroom, Terrace, Patio, Secret Garden and Intimate Gardens and all 12,000 +square feet and seven acres of your French ch&acirc;teau. Request Your Brochure Your brochure arrives right away! Questions before requesting? Call (585) 488-4899 or email bonjour@maisonalbion.com ​ \"The brochure answered every question&mdash;especially about financing. We booked our tour the same day and secured our date within the week.\" &mdash; Kelsey + Jordan, Married at Maison in 2025 ​ Our"
      },
      {
        "url": "https://www.maisonalbion.com/post/a-magical-wedding-celebration-at-maison-albion",
        "title": "A Magical Wedding Celebration at Maison Albion",
        "description": "",
        "textSample": "--> A Magical Wedding Celebration at Maison Albion top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour All Posts The Guide Real Weddings Search A Magical Wedding Celebration at Maison Albion Benjamin Glover Feb 14, 2025 1 min read Updated: Jan 2 Nestled in the heart of upstate New York, Maison Albion offers a charming blend of historic elegance and natural beauty, making it the perfect venue for a wedding. Recently, we had the pleasure of witnessing an unforgettable celebration here, where every detail reflected the joy and love of the couple&#x27;s special day. The day began with a lively outdoor gathering under Maison Albion’s lush canopy of trees. The open-air space was adorned with colorful tables, twinkling string lights, and festive décor, setting the tone for a vibrant celebration. Guests mingled and enjoyed the warm ambiance as the sun cast a golden glow over the picturesque grounds. From the first look, it was clear this wedding was a beautiful blend of tradition and modern flair. As the evening transitioned to the indoor celebration, the magic continued. The reception space at Maison Albion was alive with energy, where friends and family performed dazzling dance routines to honor the couple. Dressed in vibrant traditional attire, their joyous movements filled the room with infectious energy. The combination of elegant interiors and lively performances created a perfect harmony of elegance and festivity. Maison Albion provided the ideal backdrop for this stunning wedding, blending natural beauty with timeless charm. Every moment—from the outdoor festivities to the heartfelt cultural traditions and vibrant dances—was a testament to the love and unity shared by the couple and their families. For anyone seeking a wedding venue in upstate New York, Maison Albion promises to deliver an unforgettable experience. Venue: Maison Albion Photography: Dorian"
      },
      {
        "url": "https://www.maisonalbion.com/post/a-timeless-celebration-at-maison-albion-in-upstate-new-york",
        "title": "A Timeless Celebration at Maison Albion in Upstate New York",
        "description": "",
        "textSample": "--> A Timeless Celebration at Maison Albion in Upstate New York top of page Home Venue Accomodations Gallery About Us Past, Present, and Future Meet Our Team More Use tab to navigate through the menu items. Venue Guide Book Tour All Posts The Guide Real Weddings Search A Timeless Celebration at Maison Albion in Upstate New York Benjamin Glover Jan 31, 2025 2 min read Updated: Jan 2 Nestled in the scenic charm of Upstate New York, Maison Albion served as the enchanting venue for a wedding that exuded timeless elegance and heartfelt romance. This historic estate, with its Victorian architecture and manicured grounds, provided the perfect backdrop for the union of two souls in love. The day began with quiet anticipation as the bride prepared herself in one of Maison Albion’s exquisitely adorned rooms. Sitting gracefully on a vintage settee, she embodied a vision of classic beauty in her off-shoulder lace gown, complete with intricate floral detailing and a flowing train. The soft tones of the room’s antique wallpaper, paired with its ornate furnishings, amplified the ethereal glow of the bride’s serene moments before stepping into her new chapter. The ceremony took place outdoors, surrounded by lush greenery that framed the couple and their wedding party beautifully. Maison Albion’s picturesque gardens offered an intimate setting where friends and family gathered to witness the exchange of vows. The bride’s gown shimmered subtly in the natural light, harmonizing with the deep purple dresses of her bridesmaids and the navy suits of the groomsmen. Against this vivid backdrop, the couple stood hand in hand, radiating joy and devotion. The estate’s ornate exterior, with its stunning white facade and intricate architectural details, was another star of the event. As guests strolled through the grounds, they were greeted by elegant statues, vibrant floral arrangements, and the historic charm that makes Maison Albion a sought-after venue for special occasions. A regal stone l"
      }
    ]
  }
}
